In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
#index level

In [5]:
firstLevel =['A1','A1','A1','A2','A2','A2']

In [6]:
secondLevel = [1,2,3,1,2,3]

In [7]:
heir_index = list(zip(firstLevel,secondLevel))

In [8]:
heir_index

[('A1', 1), ('A1', 2), ('A1', 3), ('A2', 1), ('A2', 2), ('A2', 3)]

In [9]:
heir_index= pd.MultiIndex.from_tuples(heir_index)

In [10]:
#MultiIndex CREATE MULTIINDEX

In [11]:
df1 = pd.DataFrame(np.random.randn(6,2),heir_index,['A','B'])

In [12]:
df1

             A         B
A1 1  0.897106  0.793514
   2 -0.124982 -0.226249
   3  0.441416  0.288929
A2 1 -1.585753  1.215081
   2  0.745968 -1.548806
   3  0.243938  0.493485

In [13]:
df1.loc['A1'] #subset of dataframe A1

          A         B
1  0.897106  0.793514
2 -0.124982 -0.226249
3  0.441416  0.288929

In [21]:
df1.loc['A2']

          A         B
1 -1.585753  1.215081
2  0.745968 -1.548806
3  0.243938  0.493485

In [22]:
df1

             A         B
A1 1  0.897106  0.793514
   2 -0.124982 -0.226249
   3  0.441416  0.288929
A2 1 -1.585753  1.215081
   2  0.745968 -1.548806
   3  0.243938  0.493485

In [24]:
df1.loc['A1'].loc[1]

A    0.897106
B    0.793514
Name: 1, dtype: float64

In [26]:
df1.index.names

FrozenList([None, None])

In [28]:
df1.index.names=['Group','Number']

In [29]:
df1

                     A         B
Group Number
A1    1       0.897106  0.793514
      2      -0.124982 -0.226249
      3       0.441416  0.288929
A2    1      -1.585753  1.215081
      2       0.745968 -1.548806
      3       0.243938  0.493485

In [32]:
df1.xs(1,level='Number')

              A         B
Group
A1     0.897106  0.793514
A2    -1.585753  1.215081